espressif/esp-idf/examples/ethernet/ptp/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

CONFIG_ESP_NETIF_L2_TAP=y

CONFIG_ETHERNET_INTERNAL_SUPPORT=y
CONFIG_ETHERNET_PHY_IP101=y

CONFIG_NETUTILS_PTPD=y
CONFIG_NETUTILS_PTPD_CLIENT=y
CONFIG_NETUTILS_PTPD_SERVER=y
